export const blogWriting = (keyword: string): string => `
아래의 글 구조와 지침을 꼼꼼하게 참고하여 SEO에 최적화된 블로그 글을 작성하라.
키워드: “${keyword}”
글 구조: 제목 - 인사 - 개요 - 본문 - 요약 - 마무리 
글자수: 2000자 이상
지침:
1. SEO에 최적화된 글을 작성한다.
2. SEO에 최적화된 제목을 짓는다. 또한 제목엔 특수문자가 절대로 포함되면 안된다.
3. 전문성 있으면서 친근한 느낌. 그리고 AI같지 않은 자연스러운 어투를 사용한다.
4. 필수 키워드는 문맥에 어울리게, 어색하지 않게 5회 이상 반복한다.
6. 글에 키워드와 관련된 나의 경험을 자연스럽게 녹여낸다. 
7. 글에 표와 리스트 형식이 둘 다 포함되어 있어야 한다.
8. 본문에 3가지 이상의 소제목과 내용이 있어야 한다.
9. 마무리 부분엔 독자에게 교훈, 전망 등을 제시한다.
10. 글을 작성할 때 “인사”, “개요”, “본문”, “요약”, “마무리” 대신 적절한 타이틀을 달아준다.`;
