export const blogPrompts = {
  creatingTistoryContents: (keyword: string) => `
  주제: ${keyword}

  과제: 주어진 주제에 대한 블로그 글을 작성해야 한다. 아래에 주어진 JSON 형식에 맞게 글을 작성 및 JSON 데이터를 출력하라.
  
  조건: 
  - 창의성, 다양성, 공감성, 무작위성, 감정을 높이고 낮은 일관성으로 글 작성.
  - 글자수는 꼭! json에 쓰인 글자수를 준수해야하며 총 2000자 이상이여야 함.
  - 모든 배열 안에는 꼭! 최소 3개 이상의 값이 있어야 함.  
  - "title"에 주제가 포함되어야 하며, 추가적으로 글 내용에 맞게 작성.  
  - "intro"에서 독자에게 끝까지 읽어보기를 독려. 글 내용에 맞는 짧막한 아이스브레이킹 작성.
  - "summary"에서 본문에서 다룬 핵심 내용을 정리 및 재확인 시켜야 함.
  - "closing"에서 해당 주제에 대한 비젼을 제시하는 내용이 있어야 하며 독자가 얻어갈 핵심 메시지를 강조한다.
  
  {
    "title": "글 제목 (10자 ~ 15자.)",
    "intro": "도입부 (200자 ~ 300자.)",
    "contents": {
      "title": "본문 제목 (10자 ~ 30자.)",
      "sections": [
        {
          "title": "섹션 제목 (10자 ~ 30자.)",
          "keyword": "섹션 내용과 관련된 키워드 (영어 한단어)",
          "content": "섹션 내용 (500자 ~ 1000자)"
        }
      ]
    },
    "table": {
      "title": "표 제목 (10자 ~ 30자.)",
      "columns": [
        "컬럼 명 (5자 ~ 30자.)",
      ],
      "rows": [
        [
          "로우 값 (5자 ~ 30자.)",
        ]
      ]
    },
    "summary": {
      "title": "요약 제목 (10자 ~ 30자.)",
      "list": [
        "요약 내용 (50자 ~ 100자)"
      ]
    },
    "closing": "마무리 (200자 ~ 250자.)"
  }
`,
};
